---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRound
source: html/85dbf4a9-d437-74e2-e07a-7b09ce4a9fb9.htm
---
# StructuralSectionConcreteRound Members

Creates a new instance of Structural Section Concrete Round shape with the associated set of parameters,
 used to attach to structural element.